perf/results-run1.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf/scenarios/create-order.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 5m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 5m0s over 6 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2026-04-29T01:10:13+09:00" level=info msg="=== Setup: verifying services ===" source=console
time="2026-04-29T01:10:13+09:00" level=info msg="=== Services healthy, seed data confirmed ===" source=console

running (0m01.0s), 01/50 VUs, 1 complete and 0 interrupted iterations
default   [   0% ] 01/50 VUs  0m00.8s/5m00.0s

running (0m02.0s), 01/50 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m01.8s/5m00.0s

running (0m03.0s), 01/50 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 01/50 VUs  0m02.8s/5m00.0s

running (0m04.0s), 02/50 VUs, 3 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m03.8s/5m00.0s

running (0m05.0s), 02/50 VUs, 6 complete and 0 interrupted iterations
default   [   2% ] 02/50 VUs  0m04.8s/5m00.0s

running (0m06.0s), 02/50 VUs, 8 complete and 0 interrupted iterations
default   [   2% ] 02/50 VUs  0m05.8s/5m00.0s

running (0m07.0s), 03/50 VUs, 9 complete and 0 interrupted iterations
default   [   2% ] 03/50 VUs  0m06.8s/5m00.0s

running (0m08.0s), 03/50 VUs, 11 complete and 0 interrupted iterations
default   [   3% ] 03/50 VUs  0m07.8s/5m00.0s

running (0m09.0s), 03/50 VUs, 16 complete and 0 interrupted iterations
default   [   3% ] 03/50 VUs  0m08.8s/5m00.0s

running (0m10.0s), 03/50 VUs, 18 complete and 0 interrupted iterations
default   [   3% ] 03/50 VUs  0m09.8s/5m00.0s

running (0m11.0s), 04/50 VUs, 23 complete and 0 interrupted iterations
default   [   4% ] 04/50 VUs  0m10.8s/5m00.0s

running (0m12.0s), 04/50 VUs, 27 complete and 0 interrupted iterations
default   [   4% ] 04/50 VUs  0m11.8s/5m00.0s

running (0m13.0s), 04/50 VUs, 29 complete and 0 interrupted iterations
default   [   4% ] 04/50 VUs  0m12.8s/5m00.0s

running (0m14.0s), 05/50 VUs, 33 complete and 0 interrupted iterations
default   [   5% ] 05/50 VUs  0m13.8s/5m00.0s

running (0m15.0s), 05/50 VUs, 38 complete and 0 interrupted iterations
default   [   5% ] 05/50 VUs  0m14.8s/5m00.0s

running (0m16.0s), 05/50 VUs, 43 complete and 0 interrupted iterations
default   [   5% ] 05/50 VUs  0m15.8s/5m00.0s

running (0m17.0s), 06/50 VUs, 48 complete and 0 interrupted iterations
default   [   6% ] 06/50 VUs  0m16.8s/5m00.0s

running (0m18.0s), 06/50 VUs, 53 complete and 0 interrupted iterations
default   [   6% ] 06/50 VUs  0m17.8s/5m00.0s

running (0m19.0s), 06/50 VUs, 60 complete and 0 interrupted iterations
default   [   6% ] 06/50 VUs  0m18.8s/5m00.0s

running (0m20.0s), 06/50 VUs, 65 complete and 0 interrupted iterations
default   [   7% ] 06/50 VUs  0m19.8s/5m00.0s

running (0m21.0s), 07/50 VUs, 73 complete and 0 interrupted iterations
default   [   7% ] 07/50 VUs  0m20.8s/5m00.0s

running (0m22.0s), 07/50 VUs, 78 complete and 0 interrupted iterations
default   [   7% ] 07/50 VUs  0m21.8s/5m00.0s

running (0m23.0s), 07/50 VUs, 85 complete and 0 interrupted iterations
default   [   8% ] 07/50 VUs  0m22.8s/5m00.0s

running (0m24.0s), 08/50 VUs, 92 complete and 0 interrupted iterations
default   [   8% ] 08/50 VUs  0m23.8s/5m00.0s

running (0m25.0s), 08/50 VUs, 101 complete and 0 interrupted iterations
default   [   8% ] 08/50 VUs  0m24.8s/5m00.0s

running (0m26.0s), 08/50 VUs, 107 complete and 0 interrupted iterations
default   [   9% ] 08/50 VUs  0m25.8s/5m00.0s

running (0m27.0s), 09/50 VUs, 115 complete and 0 interrupted iterations
default   [   9% ] 09/50 VUs  0m26.8s/5m00.0s

running (0m28.0s), 09/50 VUs, 124 complete and 0 interrupted iterations
default   [   9% ] 09/50 VUs  0m27.8s/5m00.0s

running (0m29.0s), 09/50 VUs, 131 complete and 0 interrupted iterations
default   [  10% ] 09/50 VUs  0m28.8s/5m00.0s

running (0m30.0s), 09/50 VUs, 139 complete and 0 interrupted iterations
default   [  10% ] 09/50 VUs  0m29.8s/5m00.0s

running (0m31.0s), 10/50 VUs, 150 complete and 0 interrupted iterations
default   [  10% ] 10/50 VUs  0m30.8s/5m00.0s

running (0m32.0s), 11/50 VUs, 160 complete and 0 interrupted iterations
default   [  11% ] 11/50 VUs  0m31.8s/5m00.0s

running (0m33.0s), 11/50 VUs, 170 complete and 0 interrupted iterations
default   [  11% ] 11/50 VUs  0m32.8s/5m00.0s

running (0m34.0s), 12/50 VUs, 180 complete and 0 interrupted iterations
default   [  11% ] 12/50 VUs  0m33.8s/5m00.0s

running (0m35.0s), 13/50 VUs, 192 complete and 0 interrupted iterations
default   [  12% ] 13/50 VUs  0m34.8s/5m00.0s

running (0m36.0s), 13/50 VUs, 204 complete and 0 interrupted iterations
default   [  12% ] 13/50 VUs  0m35.8s/5m00.0s

running (0m37.0s), 14/50 VUs, 219 complete and 0 interrupted iterations
default   [  12% ] 14/50 VUs  0m36.8s/5m00.0s

running (0m38.0s), 15/50 VUs, 234 complete and 0 interrupted iterations
default   [  13% ] 15/50 VUs  0m37.8s/5m00.0s

running (0m39.0s), 15/50 VUs, 251 complete and 0 interrupted iterations
default   [  13% ] 15/50 VUs  0m38.8s/5m00.0s

running (0m40.0s), 16/50 VUs, 267 complete and 0 interrupted iterations
default   [  13% ] 16/50 VUs  0m39.8s/5m00.0s

running (0m41.0s), 17/50 VUs, 283 complete and 0 interrupted iterations
default   [  14% ] 17/50 VUs  0m40.8s/5m00.0s

running (0m42.0s), 17/50 VUs, 301 complete and 0 interrupted iterations
default   [  14% ] 17/50 VUs  0m41.8s/5m00.0s

running (0m43.0s), 18/50 VUs, 317 complete and 0 interrupted iterations
default   [  14% ] 18/50 VUs  0m42.8s/5m00.0s

running (0m44.0s), 19/50 VUs, 335 complete and 0 interrupted iterations
default   [  15% ] 19/50 VUs  0m43.8s/5m00.0s

running (0m45.0s), 19/50 VUs, 351 complete and 0 interrupted iterations
default   [  15% ] 19/50 VUs  0m44.8s/5m00.0s

running (0m46.0s), 20/50 VUs, 375 complete and 0 interrupted iterations
default   [  15% ] 20/50 VUs  0m45.8s/5m00.0s

running (0m47.0s), 21/50 VUs, 391 complete and 0 interrupted iterations
default   [  16% ] 21/50 VUs  0m46.8s/5m00.0s

running (0m48.0s), 21/50 VUs, 417 complete and 0 interrupted iterations
default   [  16% ] 21/50 VUs  0m47.8s/5m00.0s

running (0m49.0s), 22/50 VUs, 433 complete and 0 interrupted iterations
default   [  16% ] 22/50 VUs  0m48.8s/5m00.0s

running (0m50.0s), 23/50 VUs, 457 complete and 0 interrupted iterations
default   [  17% ] 23/50 VUs  0m49.8s/5m00.0s

running (0m51.0s), 23/50 VUs, 482 complete and 0 interrupted iterations
default   [  17% ] 23/50 VUs  0m50.8s/5m00.0s

running (0m52.0s), 24/50 VUs, 502 complete and 0 interrupted iterations
default   [  17% ] 24/50 VUs  0m51.8s/5m00.0s

running (0m53.0s), 25/50 VUs, 526 complete and 0 interrupted iterations
default   [  18% ] 25/50 VUs  0m52.8s/5m00.0s

running (0m54.0s), 25/50 VUs, 547 complete and 0 interrupted iterations
default   [  18% ] 25/50 VUs  0m53.8s/5m00.0s

running (0m55.0s), 26/50 VUs, 575 complete and 0 interrupted iterations
default   [  18% ] 26/50 VUs  0m54.8s/5m00.0s

running (0m56.0s), 27/50 VUs, 605 complete and 0 interrupted iterations
default   [  19% ] 27/50 VUs  0m55.8s/5m00.0s

running (0m57.0s), 27/50 VUs, 629 complete and 0 interrupted iterations
default   [  19% ] 27/50 VUs  0m56.8s/5m00.0s

running (0m58.0s), 28/50 VUs, 658 complete and 0 interrupted iterations
default   [  19% ] 28/50 VUs  0m57.8s/5m00.0s

running (0m59.0s), 29/50 VUs, 684 complete and 0 interrupted iterations
default   [  20% ] 29/50 VUs  0m58.8s/5m00.0s

running (1m00.0s), 29/50 VUs, 713 complete and 0 interrupted iterations
default   [  20% ] 29/50 VUs  0m59.8s/5m00.0s

running (1m01.0s), 30/50 VUs, 747 complete and 0 interrupted iterations
default   [  20% ] 30/50 VUs  1m00.8s/5m00.0s

running (1m02.0s), 30/50 VUs, 780 complete and 0 interrupted iterations
default   [  21% ] 30/50 VUs  1m01.8s/5m00.0s

running (1m03.0s), 30/50 VUs, 808 complete and 0 interrupted iterations
default   [  21% ] 30/50 VUs  1m02.8s/5m00.0s

running (1m04.0s), 31/50 VUs, 839 complete and 0 interrupted iterations
default   [  21% ] 31/50 VUs  1m03.8s/5m00.0s

running (1m05.0s), 31/50 VUs, 871 complete and 0 interrupted iterations
default   [  22% ] 31/50 VUs  1m04.8s/5m00.0s

running (1m06.0s), 31/50 VUs, 900 complete and 0 interrupted iterations
default   [  22% ] 31/50 VUs  1m05.8s/5m00.0s

running (1m07.0s), 32/50 VUs, 937 complete and 0 interrupted iterations
default   [  22% ] 32/50 VUs  1m06.8s/5m00.0s

running (1m08.0s), 32/50 VUs, 969 complete and 0 interrupted iterations
default   [  23% ] 32/50 VUs  1m07.8s/5m00.0s

running (1m09.0s), 32/50 VUs, 1000 complete and 0 interrupted iterations
default   [  23% ] 32/50 VUs  1m08.8s/5m00.0s

running (1m10.0s), 33/50 VUs, 1033 complete and 0 interrupted iterations
default   [  23% ] 33/50 VUs  1m09.8s/5m00.0s

running (1m11.0s), 33/50 VUs, 1066 complete and 0 interrupted iterations
default   [  24% ] 33/50 VUs  1m10.8s/5m00.0s

running (1m12.0s), 33/50 VUs, 1098 complete and 0 interrupted iterations
default   [  24% ] 33/50 VUs  1m11.8s/5m00.0s

running (1m13.0s), 34/50 VUs, 1132 complete and 0 interrupted iterations
default   [  24% ] 34/50 VUs  1m12.8s/5m00.0s

running (1m14.0s), 34/50 VUs, 1167 complete and 0 interrupted iterations
default   [  25% ] 34/50 VUs  1m13.8s/5m00.0s

running (1m15.0s), 34/50 VUs, 1197 complete and 0 interrupted iterations
default   [  25% ] 34/50 VUs  1m14.8s/5m00.0s

running (1m16.0s), 35/50 VUs, 1229 complete and 0 interrupted iterations
default   [  25% ] 35/50 VUs  1m15.8s/5m00.0s

running (1m17.0s), 35/50 VUs, 1265 complete and 0 interrupted iterations
default   [  26% ] 35/50 VUs  1m16.8s/5m00.0s

running (1m18.0s), 35/50 VUs, 1300 complete and 0 interrupted iterations
default   [  26% ] 35/50 VUs  1m17.8s/5m00.0s

running (1m19.0s), 36/50 VUs, 1331 complete and 0 interrupted iterations
default   [  26% ] 36/50 VUs  1m18.8s/5m00.0s

running (1m20.0s), 36/50 VUs, 1369 complete and 0 interrupted iterations
default   [  27% ] 36/50 VUs  1m19.8s/5m00.0s

running (1m21.0s), 36/50 VUs, 1406 complete and 0 interrupted iterations
default   [  27% ] 36/50 VUs  1m20.8s/5m00.0s

running (1m22.0s), 37/50 VUs, 1443 complete and 0 interrupted iterations
default   [  27% ] 37/50 VUs  1m21.8s/5m00.0s

running (1m23.0s), 37/50 VUs, 1478 complete and 0 interrupted iterations
default   [  28% ] 37/50 VUs  1m22.8s/5m00.0s

running (1m24.0s), 37/50 VUs, 1519 complete and 0 interrupted iterations
default   [  28% ] 37/50 VUs  1m23.8s/5m00.0s

running (1m25.0s), 38/50 VUs, 1556 complete and 0 interrupted iterations
default   [  28% ] 38/50 VUs  1m24.8s/5m00.0s

running (1m26.0s), 38/50 VUs, 1593 complete and 0 interrupted iterations
default   [  29% ] 38/50 VUs  1m25.8s/5m00.0s

running (1m27.0s), 38/50 VUs, 1630 complete and 0 interrupted iterations
default   [  29% ] 38/50 VUs  1m26.8s/5m00.0s

running (1m28.0s), 39/50 VUs, 1666 complete and 0 interrupted iterations
default   [  29% ] 39/50 VUs  1m27.8s/5m00.0s

running (1m29.0s), 39/50 VUs, 1709 complete and 0 interrupted iterations
default   [  30% ] 39/50 VUs  1m28.8s/5m00.0s

running (1m30.0s), 39/50 VUs, 1746 complete and 0 interrupted iterations
default   [  30% ] 39/50 VUs  1m29.8s/5m00.0s

running (1m31.0s), 40/50 VUs, 1782 complete and 0 interrupted iterations
default   [  30% ] 40/50 VUs  1m30.8s/5m00.0s

running (1m32.0s), 40/50 VUs, 1817 complete and 0 interrupted iterations
default   [  31% ] 40/50 VUs  1m31.8s/5m00.0s

running (1m33.0s), 40/50 VUs, 1859 complete and 0 interrupted iterations
default   [  31% ] 40/50 VUs  1m32.8s/5m00.0s

running (1m34.0s), 41/50 VUs, 1902 complete and 0 interrupted iterations
default   [  31% ] 41/50 VUs  1m33.8s/5m00.0s

running (1m35.0s), 41/50 VUs, 1938 complete and 0 interrupted iterations
default   [  32% ] 41/50 VUs  1m34.8s/5m00.0s

running (1m36.0s), 41/50 VUs, 1979 complete and 0 interrupted iterations
default   [  32% ] 41/50 VUs  1m35.8s/5m00.0s

running (1m37.0s), 42/50 VUs, 2018 complete and 0 interrupted iterations
default   [  32% ] 42/50 VUs  1m36.8s/5m00.0s

running (1m38.0s), 42/50 VUs, 2061 complete and 0 interrupted iterations
default   [  33% ] 42/50 VUs  1m37.8s/5m00.0s

running (1m39.0s), 42/50 VUs, 2102 complete and 0 interrupted iterations
default   [  33% ] 42/50 VUs  1m38.8s/5m00.0s

running (1m40.0s), 43/50 VUs, 2144 complete and 0 interrupted iterations
default   [  33% ] 43/50 VUs  1m39.8s/5m00.0s

running (1m41.0s), 43/50 VUs, 2187 complete and 0 interrupted iterations
default   [  34% ] 43/50 VUs  1m40.8s/5m00.0s

running (1m42.0s), 43/50 VUs, 2229 complete and 0 interrupted iterations
default   [  34% ] 43/50 VUs  1m41.8s/5m00.0s

running (1m43.0s), 44/50 VUs, 2272 complete and 0 interrupted iterations
default   [  34% ] 44/50 VUs  1m42.8s/5m00.0s

running (1m44.0s), 44/50 VUs, 2313 complete and 0 interrupted iterations
default   [  35% ] 44/50 VUs  1m43.8s/5m00.0s

running (1m45.0s), 44/50 VUs, 2354 complete and 0 interrupted iterations
default   [  35% ] 44/50 VUs  1m44.8s/5m00.0s

running (1m46.0s), 45/50 VUs, 2401 complete and 0 interrupted iterations
default   [  35% ] 45/50 VUs  1m45.8s/5m00.0s

running (1m47.0s), 45/50 VUs, 2446 complete and 0 interrupted iterations
default   [  36% ] 45/50 VUs  1m46.8s/5m00.0s

running (1m48.0s), 45/50 VUs, 2492 complete and 0 interrupted iterations
default   [  36% ] 45/50 VUs  1m47.8s/5m00.0s

running (1m49.0s), 46/50 VUs, 2538 complete and 0 interrupted iterations
default   [  36% ] 46/50 VUs  1m48.8s/5m00.0s

running (1m50.0s), 46/50 VUs, 2578 complete and 0 interrupted iterations
default   [  37% ] 46/50 VUs  1m49.8s/5m00.0s

running (1m51.0s), 46/50 VUs, 2621 complete and 0 interrupted iterations
default   [  37% ] 46/50 VUs  1m50.8s/5m00.0s

running (1m52.0s), 47/50 VUs, 2669 complete and 0 interrupted iterations
default   [  37% ] 47/50 VUs  1m51.8s/5m00.0s

running (1m53.0s), 47/50 VUs, 2712 complete and 0 interrupted iterations
default   [  38% ] 47/50 VUs  1m52.8s/5m00.0s

running (1m54.0s), 47/50 VUs, 2757 complete and 0 interrupted iterations
default   [  38% ] 47/50 VUs  1m53.8s/5m00.0s

running (1m55.0s), 48/50 VUs, 2803 complete and 0 interrupted iterations
default   [  38% ] 48/50 VUs  1m54.8s/5m00.0s

running (1m56.0s), 48/50 VUs, 2853 complete and 0 interrupted iterations
default   [  39% ] 48/50 VUs  1m55.8s/5m00.0s

running (1m57.0s), 48/50 VUs, 2901 complete and 0 interrupted iterations
default   [  39% ] 48/50 VUs  1m56.8s/5m00.0s

running (1m58.0s), 49/50 VUs, 2952 complete and 0 interrupted iterations
default   [  39% ] 49/50 VUs  1m57.8s/5m00.0s

running (1m59.0s), 49/50 VUs, 3007 complete and 0 interrupted iterations
default   [  40% ] 49/50 VUs  1m58.8s/5m00.0s

running (2m00.0s), 49/50 VUs, 3057 complete and 0 interrupted iterations
default   [  40% ] 49/50 VUs  1m59.8s/5m00.0s

running (2m01.0s), 50/50 VUs, 3105 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  2m00.8s/5m00.0s

running (2m02.0s), 50/50 VUs, 3156 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m01.8s/5m00.0s

running (2m03.0s), 50/50 VUs, 3206 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m02.8s/5m00.0s

running (2m04.0s), 50/50 VUs, 3247 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  2m03.8s/5m00.0s

running (2m05.0s), 50/50 VUs, 3302 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m04.8s/5m00.0s

running (2m06.0s), 50/50 VUs, 3350 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m05.8s/5m00.0s

running (2m07.0s), 50/50 VUs, 3395 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  2m06.8s/5m00.0s

running (2m08.0s), 50/50 VUs, 3447 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m07.8s/5m00.0s

running (2m09.0s), 50/50 VUs, 3497 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m08.8s/5m00.0s

running (2m10.0s), 50/50 VUs, 3542 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  2m09.8s/5m00.0s

running (2m11.0s), 50/50 VUs, 3588 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m10.8s/5m00.0s

running (2m12.0s), 50/50 VUs, 3641 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m11.8s/5m00.0s

running (2m13.0s), 50/50 VUs, 3690 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  2m12.8s/5m00.0s

running (2m14.0s), 50/50 VUs, 3736 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m13.8s/5m00.0s

running (2m15.0s), 50/50 VUs, 3784 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m14.8s/5m00.0s

running (2m16.0s), 50/50 VUs, 3836 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  2m15.8s/5m00.0s

running (2m17.0s), 50/50 VUs, 3887 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m16.8s/5m00.0s

running (2m18.0s), 50/50 VUs, 3936 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m17.8s/5m00.0s

running (2m19.0s), 50/50 VUs, 3981 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  2m18.8s/5m00.0s

running (2m20.0s), 50/50 VUs, 4032 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m19.8s/5m00.0s

running (2m21.0s), 50/50 VUs, 4076 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m20.8s/5m00.0s

running (2m22.0s), 50/50 VUs, 4130 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  2m21.8s/5m00.0s

running (2m23.0s), 50/50 VUs, 4185 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m22.8s/5m00.0s

running (2m24.0s), 50/50 VUs, 4231 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m23.8s/5m00.0s

running (2m25.0s), 50/50 VUs, 4284 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  2m24.8s/5m00.0s

running (2m26.0s), 50/50 VUs, 4329 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m25.8s/5m00.0s

running (2m27.0s), 50/50 VUs, 4383 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m26.8s/5m00.0s

running (2m28.0s), 50/50 VUs, 4428 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  2m27.8s/5m00.0s

running (2m29.0s), 50/50 VUs, 4475 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m28.8s/5m00.0s

running (2m30.0s), 50/50 VUs, 4525 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m29.8s/5m00.0s

running (2m31.0s), 50/50 VUs, 4570 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  2m30.8s/5m00.0s

running (2m32.0s), 50/50 VUs, 4623 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m31.8s/5m00.0s

running (2m33.0s), 50/50 VUs, 4678 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m32.8s/5m00.0s

running (2m34.0s), 50/50 VUs, 4718 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  2m33.8s/5m00.0s

running (2m35.0s), 50/50 VUs, 4768 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m34.8s/5m00.0s

running (2m36.0s), 50/50 VUs, 4820 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m35.8s/5m00.0s

running (2m37.0s), 50/50 VUs, 4872 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  2m36.8s/5m00.0s

running (2m38.0s), 50/50 VUs, 4921 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m37.8s/5m00.0s

running (2m39.0s), 50/50 VUs, 4971 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m38.8s/5m00.0s

running (2m40.0s), 50/50 VUs, 5020 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  2m39.8s/5m00.0s

running (2m41.0s), 50/50 VUs, 5073 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m40.8s/5m00.0s

running (2m42.0s), 50/50 VUs, 5121 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m41.8s/5m00.0s

running (2m43.0s), 50/50 VUs, 5171 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  2m42.8s/5m00.0s

running (2m44.0s), 50/50 VUs, 5217 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m43.8s/5m00.0s

running (2m45.0s), 50/50 VUs, 5269 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m44.8s/5m00.0s

running (2m46.0s), 50/50 VUs, 5324 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  2m45.8s/5m00.0s

running (2m47.0s), 50/50 VUs, 5376 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m46.8s/5m00.0s

running (2m48.0s), 50/50 VUs, 5426 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m47.8s/5m00.0s

running (2m49.0s), 50/50 VUs, 5478 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  2m48.8s/5m00.0s

running (2m50.0s), 50/50 VUs, 5523 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m49.8s/5m00.0s

running (2m51.0s), 50/50 VUs, 5570 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m50.8s/5m00.0s

running (2m52.0s), 50/50 VUs, 5614 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  2m51.8s/5m00.0s

running (2m53.0s), 50/50 VUs, 5667 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m52.8s/5m00.0s

running (2m54.0s), 50/50 VUs, 5717 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m53.9s/5m00.0s

running (2m55.0s), 50/50 VUs, 5765 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  2m54.8s/5m00.0s

running (2m56.0s), 50/50 VUs, 5814 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m55.8s/5m00.0s

running (2m57.0s), 50/50 VUs, 5863 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m56.8s/5m00.0s

running (2m58.0s), 50/50 VUs, 5912 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  2m57.8s/5m00.0s

running (2m59.0s), 50/50 VUs, 5962 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m58.8s/5m00.0s

running (3m00.0s), 50/50 VUs, 6006 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  2m59.8s/5m00.0s

running (3m01.0s), 50/50 VUs, 6059 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  3m00.8s/5m00.0s

running (3m02.0s), 50/50 VUs, 6104 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m01.8s/5m00.0s

running (3m03.0s), 50/50 VUs, 6157 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m02.8s/5m00.0s

running (3m04.0s), 50/50 VUs, 6208 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  3m03.8s/5m00.0s

running (3m05.0s), 50/50 VUs, 6260 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m04.8s/5m00.0s

running (3m06.0s), 50/50 VUs, 6312 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m05.8s/5m00.0s

running (3m07.0s), 50/50 VUs, 6360 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  3m06.8s/5m00.0s

running (3m08.0s), 50/50 VUs, 6408 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m07.8s/5m00.0s

running (3m09.0s), 50/50 VUs, 6460 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m08.8s/5m00.0s

running (3m10.0s), 50/50 VUs, 6505 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  3m09.8s/5m00.0s

running (3m11.0s), 50/50 VUs, 6550 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m10.8s/5m00.0s

running (3m12.0s), 50/50 VUs, 6602 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m11.8s/5m00.0s

running (3m13.0s), 50/50 VUs, 6657 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  3m12.8s/5m00.0s

running (3m14.0s), 50/50 VUs, 6708 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m13.8s/5m00.0s

running (3m15.0s), 50/50 VUs, 6752 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m14.8s/5m00.0s

running (3m16.0s), 50/50 VUs, 6799 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  3m15.8s/5m00.0s

running (3m17.0s), 50/50 VUs, 6848 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m16.8s/5m00.0s

running (3m18.0s), 50/50 VUs, 6895 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m17.8s/5m00.0s

running (3m19.0s), 50/50 VUs, 6942 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  3m18.8s/5m00.0s

running (3m20.0s), 50/50 VUs, 6988 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m19.8s/5m00.0s

running (3m21.0s), 50/50 VUs, 7040 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m20.8s/5m00.0s

running (3m22.0s), 50/50 VUs, 7090 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  3m21.8s/5m00.0s

running (3m23.0s), 50/50 VUs, 7135 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m22.8s/5m00.0s

running (3m24.0s), 50/50 VUs, 7184 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m23.8s/5m00.0s

running (3m25.0s), 50/50 VUs, 7235 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  3m24.8s/5m00.0s

running (3m26.0s), 50/50 VUs, 7284 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m25.8s/5m00.0s

running (3m27.0s), 50/50 VUs, 7337 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m26.8s/5m00.0s

running (3m28.0s), 50/50 VUs, 7384 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  3m27.8s/5m00.0s

running (3m29.0s), 50/50 VUs, 7434 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m28.8s/5m00.0s

running (3m30.0s), 50/50 VUs, 7479 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m29.8s/5m00.0s

running (3m31.0s), 50/50 VUs, 7521 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  3m30.8s/5m00.0s

running (3m32.0s), 50/50 VUs, 7572 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m31.8s/5m00.0s

running (3m33.0s), 50/50 VUs, 7626 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m32.8s/5m00.0s

running (3m34.0s), 50/50 VUs, 7669 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  3m33.8s/5m00.0s

running (3m35.0s), 50/50 VUs, 7718 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m34.8s/5m00.0s

running (3m36.0s), 50/50 VUs, 7768 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m35.8s/5m00.0s

running (3m37.0s), 50/50 VUs, 7820 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  3m36.8s/5m00.0s

running (3m38.0s), 50/50 VUs, 7871 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m37.8s/5m00.0s

running (3m39.0s), 50/50 VUs, 7915 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m38.8s/5m00.0s

running (3m40.0s), 50/50 VUs, 7962 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  3m39.8s/5m00.0s

running (3m41.0s), 50/50 VUs, 8013 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m40.8s/5m00.0s

running (3m42.0s), 50/50 VUs, 8063 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m41.8s/5m00.0s

running (3m43.0s), 50/50 VUs, 8116 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  3m42.8s/5m00.0s

running (3m44.0s), 50/50 VUs, 8162 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m43.8s/5m00.0s

running (3m45.0s), 50/50 VUs, 8210 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m44.8s/5m00.0s

running (3m46.0s), 50/50 VUs, 8257 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  3m45.8s/5m00.0s

running (3m47.0s), 50/50 VUs, 8306 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m46.8s/5m00.0s

running (3m48.0s), 50/50 VUs, 8353 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m47.8s/5m00.0s

running (3m49.0s), 50/50 VUs, 8403 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  3m48.8s/5m00.0s

running (3m50.0s), 50/50 VUs, 8451 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m49.8s/5m00.0s

running (3m51.0s), 50/50 VUs, 8502 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m50.8s/5m00.0s

running (3m52.0s), 50/50 VUs, 8551 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  3m51.8s/5m00.0s

running (3m53.0s), 50/50 VUs, 8591 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m52.8s/5m00.0s

running (3m54.0s), 50/50 VUs, 8642 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m53.8s/5m00.0s

running (3m55.0s), 50/50 VUs, 8695 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  3m54.8s/5m00.0s

running (3m56.0s), 50/50 VUs, 8735 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m55.8s/5m00.0s

running (3m57.0s), 50/50 VUs, 8779 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m56.8s/5m00.0s

running (3m58.0s), 50/50 VUs, 8825 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  3m57.8s/5m00.0s

running (3m59.0s), 50/50 VUs, 8875 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  3m58.8s/5m00.0s

running (4m00.0s), 50/50 VUs, 8924 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  3m59.8s/5m00.0s

running (4m01.0s), 50/50 VUs, 8977 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  4m00.8s/5m00.0s

running (4m02.0s), 49/50 VUs, 9020 complete and 0 interrupted iterations
default   [  81% ] 49/50 VUs  4m01.8s/5m00.0s

running (4m03.0s), 48/50 VUs, 9068 complete and 0 interrupted iterations
default   [  81% ] 48/50 VUs  4m02.8s/5m00.0s

running (4m04.0s), 47/50 VUs, 9122 complete and 0 interrupted iterations
default   [  81% ] 47/50 VUs  4m03.8s/5m00.0s

running (4m05.0s), 46/50 VUs, 9163 complete and 0 interrupted iterations
default   [  82% ] 46/50 VUs  4m04.8s/5m00.0s

running (4m06.0s), 46/50 VUs, 9210 complete and 0 interrupted iterations
default   [  82% ] 46/50 VUs  4m05.8s/5m00.0s

running (4m07.0s), 45/50 VUs, 9257 complete and 0 interrupted iterations
default   [  82% ] 45/50 VUs  4m06.8s/5m00.0s

running (4m08.0s), 43/50 VUs, 9303 complete and 0 interrupted iterations
default   [  83% ] 43/50 VUs  4m07.8s/5m00.0s

running (4m09.0s), 42/50 VUs, 9342 complete and 0 interrupted iterations
default   [  83% ] 42/50 VUs  4m08.8s/5m00.0s

running (4m10.0s), 42/50 VUs, 9383 complete and 0 interrupted iterations
default   [  83% ] 42/50 VUs  4m09.8s/5m00.0s

running (4m11.0s), 40/50 VUs, 9424 complete and 0 interrupted iterations
default   [  84% ] 40/50 VUs  4m10.8s/5m00.0s

running (4m12.0s), 40/50 VUs, 9462 complete and 0 interrupted iterations
default   [  84% ] 40/50 VUs  4m11.8s/5m00.0s

running (4m13.0s), 38/50 VUs, 9503 complete and 0 interrupted iterations
default   [  84% ] 38/50 VUs  4m12.8s/5m00.0s

running (4m14.0s), 37/50 VUs, 9538 complete and 0 interrupted iterations
default   [  85% ] 37/50 VUs  4m13.8s/5m00.0s

running (4m15.0s), 36/50 VUs, 9577 complete and 0 interrupted iterations
default   [  85% ] 36/50 VUs  4m14.8s/5m00.0s

running (4m16.0s), 35/50 VUs, 9612 complete and 0 interrupted iterations
default   [  85% ] 35/50 VUs  4m15.8s/5m00.0s

running (4m17.0s), 35/50 VUs, 9647 complete and 0 interrupted iterations
default   [  86% ] 35/50 VUs  4m16.8s/5m00.0s

running (4m18.0s), 33/50 VUs, 9680 complete and 0 interrupted iterations
default   [  86% ] 33/50 VUs  4m17.8s/5m00.0s

running (4m19.0s), 32/50 VUs, 9716 complete and 0 interrupted iterations
default   [  86% ] 32/50 VUs  4m18.8s/5m00.0s

running (4m20.0s), 31/50 VUs, 9747 complete and 0 interrupted iterations
default   [  87% ] 31/50 VUs  4m19.8s/5m00.0s

running (4m21.0s), 31/50 VUs, 9775 complete and 0 interrupted iterations
default   [  87% ] 31/50 VUs  4m20.8s/5m00.0s

running (4m22.0s), 29/50 VUs, 9803 complete and 0 interrupted iterations
default   [  87% ] 29/50 VUs  4m21.8s/5m00.0s

running (4m23.0s), 28/50 VUs, 9830 complete and 0 interrupted iterations
default   [  88% ] 28/50 VUs  4m22.8s/5m00.0s

running (4m24.0s), 27/50 VUs, 9858 complete and 0 interrupted iterations
default   [  88% ] 27/50 VUs  4m23.8s/5m00.0s

running (4m25.0s), 26/50 VUs, 9885 complete and 0 interrupted iterations
default   [  88% ] 26/50 VUs  4m24.8s/5m00.0s

running (4m26.0s), 26/50 VUs, 9906 complete and 0 interrupted iterations
default   [  89% ] 26/50 VUs  4m25.8s/5m00.0s

running (4m27.0s), 25/50 VUs, 9931 complete and 0 interrupted iterations
default   [  89% ] 25/50 VUs  4m26.8s/5m00.0s

running (4m28.0s), 23/50 VUs, 9956 complete and 0 interrupted iterations
default   [  89% ] 23/50 VUs  4m27.8s/5m00.0s

running (4m29.0s), 23/50 VUs, 9979 complete and 0 interrupted iterations
default   [  90% ] 23/50 VUs  4m28.8s/5m00.0s

running (4m30.0s), 21/50 VUs, 10005 complete and 0 interrupted iterations
default   [  90% ] 21/50 VUs  4m29.8s/5m00.0s

running (4m31.0s), 20/50 VUs, 10026 complete and 0 interrupted iterations
default   [  90% ] 20/50 VUs  4m30.8s/5m00.0s

running (4m32.0s), 20/50 VUs, 10045 complete and 0 interrupted iterations
default   [  91% ] 20/50 VUs  4m31.8s/5m00.0s

running (4m33.0s), 19/50 VUs, 10065 complete and 0 interrupted iterations
default   [  91% ] 19/50 VUs  4m32.8s/5m00.0s

running (4m34.0s), 19/50 VUs, 10085 complete and 0 interrupted iterations
default   [  91% ] 19/50 VUs  4m33.8s/5m00.0s

running (4m35.0s), 17/50 VUs, 10101 complete and 0 interrupted iterations
default   [  92% ] 17/50 VUs  4m34.8s/5m00.0s

running (4m36.0s), 17/50 VUs, 10118 complete and 0 interrupted iterations
default   [  92% ] 17/50 VUs  4m35.8s/5m00.0s

running (4m37.0s), 16/50 VUs, 10137 complete and 0 interrupted iterations
default   [  92% ] 16/50 VUs  4m36.8s/5m00.0s

running (4m38.0s), 16/50 VUs, 10151 complete and 0 interrupted iterations
default   [  93% ] 16/50 VUs  4m37.8s/5m00.0s

running (4m39.0s), 15/50 VUs, 10165 complete and 0 interrupted iterations
default   [  93% ] 15/50 VUs  4m38.8s/5m00.0s

running (4m40.0s), 14/50 VUs, 10178 complete and 0 interrupted iterations
default   [  93% ] 14/50 VUs  4m39.8s/5m00.0s

running (4m41.0s), 14/50 VUs, 10193 complete and 0 interrupted iterations
default   [  94% ] 14/50 VUs  4m40.8s/5m00.0s

running (4m42.0s), 13/50 VUs, 10205 complete and 0 interrupted iterations
default   [  94% ] 13/50 VUs  4m41.8s/5m00.0s

running (4m43.0s), 12/50 VUs, 10219 complete and 0 interrupted iterations
default   [  94% ] 12/50 VUs  4m42.8s/5m00.0s

running (4m44.0s), 12/50 VUs, 10233 complete and 0 interrupted iterations
default   [  95% ] 12/50 VUs  4m43.8s/5m00.0s

running (4m45.0s), 11/50 VUs, 10245 complete and 0 interrupted iterations
default   [  95% ] 11/50 VUs  4m44.8s/5m00.0s

running (4m46.0s), 10/50 VUs, 10257 complete and 0 interrupted iterations
default   [  95% ] 10/50 VUs  4m45.8s/5m00.0s

running (4m47.0s), 10/50 VUs, 10264 complete and 0 interrupted iterations
default   [  96% ] 10/50 VUs  4m46.8s/5m00.0s

running (4m48.0s), 10/50 VUs, 10271 complete and 0 interrupted iterations
default   [  96% ] 10/50 VUs  4m47.8s/5m00.0s

running (4m49.0s), 08/50 VUs, 10279 complete and 0 interrupted iterations
default   [  96% ] 08/50 VUs  4m48.8s/5m00.0s

running (4m50.0s), 07/50 VUs, 10288 complete and 0 interrupted iterations
default   [  97% ] 07/50 VUs  4m49.8s/5m00.0s

running (4m51.0s), 07/50 VUs, 10294 complete and 0 interrupted iterations
default   [  97% ] 07/50 VUs  4m50.8s/5m00.0s

running (4m52.0s), 06/50 VUs, 10302 complete and 0 interrupted iterations
default   [  97% ] 06/50 VUs  4m51.8s/5m00.0s

running (4m53.0s), 06/50 VUs, 10307 complete and 0 interrupted iterations
default   [  98% ] 06/50 VUs  4m52.8s/5m00.0s

running (4m54.0s), 05/50 VUs, 10313 complete and 0 interrupted iterations
default   [  98% ] 05/50 VUs  4m53.8s/5m00.0s

running (4m55.0s), 05/50 VUs, 10318 complete and 0 interrupted iterations
default   [  98% ] 05/50 VUs  4m54.8s/5m00.0s

running (4m56.0s), 03/50 VUs, 10323 complete and 0 interrupted iterations
default   [  99% ] 03/50 VUs  4m55.8s/5m00.0s

running (4m57.0s), 03/50 VUs, 10326 complete and 0 interrupted iterations
default   [  99% ] 03/50 VUs  4m56.8s/5m00.0s

running (4m58.0s), 02/50 VUs, 10329 complete and 0 interrupted iterations
default   [  99% ] 02/50 VUs  4m57.8s/5m00.0s

running (4m59.0s), 02/50 VUs, 10331 complete and 0 interrupted iterations
default   [ 100% ] 02/50 VUs  4m58.8s/5m00.0s

running (5m00.0s), 01/50 VUs, 10333 complete and 0 interrupted iterations
default   [ 100% ] 01/50 VUs  4m59.8s/5m00.0s
time="2026-04-29T01:15:14+09:00" level=info msg="=== Teardown: load test complete ===" source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=44.67ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    order_create_duration
    ✓ 'p(95)<500' p(95)=45ms


  █ TOTAL RESULTS 

    checks_total.......: 31005  103.097171/s
    checks_succeeded...: 98.54% 30553 out of 31005
    checks_failed......: 1.45%  452 out of 31005

    ✓ inventory-service healthy
    ✓ order-service healthy
    ✓ seed data loaded
    ✓ status is 200
    ✓ has order id
    ✗ status is CONFIRMED
      ↳  95% — ✓ 9882 / ✗ 452

    CUSTOM
    order_create_duration..........: avg=14.61ms min=3ms      med=8ms    max=1.06s p(90)=30ms    p(95)=45ms   
    orders_created.................: 9882   32.859418/s
    orders_failed..................: 452    1.502981/s

    HTTP
    http_req_duration..............: avg=14.43ms min=3.26ms   med=7.53ms max=1.06s p(90)=29.82ms p(95)=44.67ms
      { expected_response:true }...: avg=14.43ms min=3.26ms   med=7.53ms max=1.06s p(90)=29.82ms p(95)=44.67ms
    http_req_failed................: 0.00%  0 out of 10337
    http_reqs......................: 10337  34.372374/s

    EXECUTION
    iteration_duration.............: avg=1.01s   min=506.75ms med=1.01s  max=1.91s p(90)=1.41s   p(95)=1.46s  
    iterations.....................: 10334  34.362398/s
    vus............................: 1      min=1          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 3.4 MB 11 kB/s
    data_sent......................: 2.4 MB 7.9 kB/s

running (5m00.7s), 00/50 VUs, 10334 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  5m0s